{
    "questions": 
    [
        {
        "id": 1,
        "difficulty": "easy",
        "type": "text",
        "main-title": "DPD delivery attempt?",
        "scene-info":"You have received a text message from DPD delivery regarding a delivery attempt. Is this a phishing attempt?",
    
        "scenario": {
         "sender": "DPD delivery",
            "message-date": "23/09/2025 10:52",
            "title": "Atempted delivery Of your package",
            "content": "we attempted to deliver your package however there was nobody avialable to receive it. To arrange a redelivery please click the link bleow http:/delivery-dpd.coom/re-schedule"
        },
        "isPhishing": true,
        "explanation": "This is a phishing attempt as the link goes to a unknown domain and in addition the mismatched spelling and urgent language used "
},
    {
    "id": 2,
    "difficulty": "easy",
    "type": "email",
    "main-title": "Company changing payroll system ",
    "scene-info":"Check the scenario carefully and pay close attention to the spellings and links ",
    
    "scenario": {
        "sender": "HR-ppayroll@gmail.com",
        "message-date": "29/01/2022 12:44",
        "title": "Set up e-payslips for your account",
        "content": "We started getting all employees to change to e-payslips from paper paylsips.\n To set up your account please click this link below \nhttp:/payroll-setupp-free.com/setup"
    },
    "isPhishing": true,
    "explanation": "This is a phishing email as show in a few ways. The sender is not specifically from a company domain instead it is from a generic google gmail account domain which is common by attackers to seem more legitimate. The link provided is also not legitimate as it does not link to a real platform instead it is trying to mimic one with payrolls and setup used in the link is trying to make it more legitimate. "
},
    {
    "id": 3,
    "difficulty": "easy",
    "type": "text",
    "main-title":"Won the lottery? Lucky me",
    "scene-info":"Did you really win the lottery ",
    
    "scenario": {
        "sender": "Unknown",
        "message-date": "24/10/2025 14:32",
        "title": " ",
        "content": "Your number has won £10000 pounds! IN the weekly draw. send your name, address, account detail to this number to claim. +1 0522567898"
    },
    "isPhishing": true,
    "explanation": "This is a phishing attempt as it claims that the person recieving this message has won a large sum of money even though they havent entered any competition. The message contains some spelling and gramamatical errors and comes from an unkown sender which is a very common indication of scam messages. It also requests personal information though SMS which is not a legitimate method to claim prizes, especially this high."
},
    {
    "id": 4,
    "difficulty": "medium",
    "type": "email",
    "main-title":"Google login attempt?",
    "scene-info":"Look out for language used and the links",

    "scenario": {
        "sender": "noreply@security-google.uk",
        "message-date": "05/03/2024 09:15",
        "title": "Critical Security Alert",
        "content": "Sign in attempt blocked\njohn.smith@gmail.com\nSomebody used your password to try to sign in to your account from an unusual location. we have taken steps to secure your account. Sign back into your account and reset your password from the link below \nhttps://google-security.co/reset "  
    },
    "isPhishing": true,
    "explanation":" This email scenario here represents a medium difficulty in recognising that it is phishing as it is very close to google's security alert emails. However there are some red flags which are presented if you look closer. The sender domain and the link dont match what google's actual domain is and the links also doesnt match with google's official domains. The message has very urgent language used by requesting immediate action by accessing the account through the link given."
},
    {
    "id": 5,
    "difficulty": "medium",
    "type": "email",
    "main-title":"LinkedIn connection request?",
    "scene-info":"Check who is trying to connect with you on LinkedIn",
    
    "scenario": {
        "sender": "notifications@LinkedIn.co",
        "message-date": "31/12/2024 09:45",
        "title": "Joe Gazi wants to connect",
        "content": "Hi there,\n\nJoe Gazi (employee at X) would like to connect with you on LinkedIn.\n\nView profile and accept connection :\nhttps://wvw.linkedin.com.profile-view.net/profile/joe-gazi\n\nLinkedIn respects privacy."  
    },
    "isPhishing": true,
    "explanation": "This is phishing. The domain wvw.linkedin.com.profile-view.net/profile/joe-gazi is fake - the real domain would be profile-view.net not linkedin.com. Legitimate LinkedIn emails also use linkedin.com/ but not in this way. The email format is more professional but the URL makes it more obvious also with the use of more urgent language."
},
    {
    "id": 6,
    "difficulty": "medium",
    "type": "DM",
    "main-title":"Microsoft support message?",
    "scene-info":"Make sure you check your links and language",
    
    "scenario": {
        "sender": "Microsoft ",
        "message-date": "10/01/2025 12:00",
        "title": "",
        "content": "Thank you for using Support.To Continue with your activation please click here:\nhttps://support.microsoft.com/en-us"   
    },
    "isPhishing": false,
    "explanation": "This is not phishing as it is an actual microsoft support message. The link provided is a legitimate microsoft link to their main support page. "
},
    {
    "id": 7,
    "difficulty": "hard",
    "type": "email",
    "main-title":"IT department update ",
    "scene-info":"check the emails carefully",    
    
    "scenario": {
        "sender": "itsupport@justIT.com",
        "message-date": "22/11/2025 16:39",
        "title": "Required: Password Policy Update",
        "content": "Dear Team,\n\nAs part of our security enhancement initiative, all employees must update their passwords by Friday.\n\nPlease use our secure portal:\nhttps://portal.justIT.com/password-reset\n\nFailure to comply may result in account suspension.\n\nKind regards,\nIT Security Team"   
    },
    "isPhishing": true,
    "explanation": "Phishing attempt. The sender email 'itsupport@justIT.com' is close but not the actual company domain (should be '@justit.com'). The urgency and threat of suspension is a pressure tactic. Legitimate IT departments typically don't send random unexpected password reset links."
},
    {
    "id": 8,
    "difficulty": "hard",
    "type": "email",
    "main-title":"Netflix subscription renewal?",
    "scene-info":"Read carefully and see if you actually have a renewal ",
    
    "scenario": {
        "sender": "alert@netflix.com",
        "message-date": "04/08/2025 17:52",
        "title": "Payment Method Update Required",
        "content": "Your netflix subscription is set to be renewed in 3 days. Your payment method ending in **8275 has declined. Update your billing information to avoid further interuptions: https://netflix.com/account/billing-netflixsupport"  
    },
    "isPhishing": true,
    "explanation": "This is phishing. The typo 'interuptions' instead of 'interruptions' is a slight indicator. The link may also look legitimate, scammers often display text thats fake when the hyperlink when you press or hover over the link will lead to another page. Always verify payment difficulties or issues with the site directly or in their app rather than pressing links on unexpected emails."
},
    {
    "id": 9,
    "difficulty": "hard",
    "type": "email",
    "main-title":"Somebody has starred your repository",
    "scene-info":"Your project is starting to get attention",
    
    "scenario": {
        "sender": "notifications@github.com",
        "message-date": "17/07/2023 13:52",
        "title": "spot_bob starred your repository :OliL0/CyberThreat-Simulator-",
        "content": "spot_bob starred OliL0/CyberThreat-Simulator. Repository: OliL0/CyberThreat-Simulator- An interactive education project designed to teach cyber security awareness through simulated scenarios and quizzes. Stars: 10. View repository:https://github.com/OliL0/CyberThreat-Simulator- View spot_bob's profile: https://github.com/spot_bob - You're receiving this because you own this repository. Change notifications settings: https://github.com/settings/notifications"   
    },
    "isPhishing": false,
    "explanation": "This is a legitimate Github notification email for repository activity. Github sends these types of notifications when somebody stars, forks or watches your repository. The sender 'notifications@github.com' is a known legitimate sender for GitHub. The URLs 'github.com/OliL0/CyberThreat-Simulator-' and 'github.com/spot_bob' are valid GitHub profile and repository formats. The email content and structure is consistent with typical GitHub notifications, making this a genuine email rather than a phishing attempt. The notification link 'github.com/settings/notifications' is also a legitimate link. These notifications are quite commmon for public repositories."
}
]
}